Attendance/app/controllers/attendances_controller.rb

  def index
    @date = Date.new(Time.now.year, Time.now.month, Time.now.day)
    @attendances = Attendance.find(:all, :conditions=>['Entry_timestamp > ?', @date])
---
SELECT * FROM "attendances" WHERE (Entry_timestamp > '2009-08-17 23:47:00')

  def create
    @attendance = Attendance.new(params[:attendance])
    @attendance.save
---
INSERT INTO "attendances" ("updated_at", "Entry_Timestamp", "EmpId", "date_dim_id", "created_at") VALUES('2009-08-12 02:05:14', '2009-08-11 07:16:00', 'Rajith`', NULL, '2009-08-12 02:05:14')

  def find
    newDae = Date.new(ParseDate.parsedate(params[:date])[0],ParseDate.parsedate(params[:date])[1],ParseDate.parsedate(params[:date])[2])
    afterOneDate = newDae + 1
    @date = newDae
    @attendances = Attendance.find(:all, :conditions=>['Entry_timestamp > ? and Entry_timestamp < ?', newDae, afterOneDate])
---
SELECT * FROM "attendances" WHERE (Entry_timestamp > '2009-03-05' and Entry_timestamp < '2009-03-06')